[
  {
    "id": "1",
    "media": "history/img1.webp",
    "description": "У 2021-2022 навчальному році Київська дитяча школа мистецтв № 2імені M. I. Вериківського відсвяткувала свій ювілей – 90 річницю від дня утворення.Навчальний заклад був утворений у 1930 році як Дитяча музична школа № 2, а у 1986  наказом Міністерства культури УССР від 22.09.1986 р. № 640 був реорганізований у Дитячу школу мистецтв № 2.Постановою Кабінету Міністрів України від 29.07.1999 р. № 1371 школі присвоєно імʼя видатного українського композитора, диригента і педагогаМихайла Івановича Вериківського. З того ж року школа називається: Дитячий спеціалізований мистецький навчальний заклад «Київська дитяча школа мистецтв № 2 імені M. I.  Вериківського»."
  },
  {
    "id": "2",
    "description": "Школа є одним із найстаріших осередків в Україні, де виховуються таланти і впроваджуються інноваційні ідеї інтегративної мистецької освіти.Зміст навчально-виховного процесу у закладі відповідає Державній цільовій програмі «Робота з обдарованою молоддю». Школа активно співпрацює з Інститутом проблем виховання НАПН України.КДШМ № 2 однією з перших в Україні почала втілювати комплексний підхід до пошуку, виявлення і розвитку обдарованих дітей, працюючи за експериментальним навчальним планом, який затверджено Міністерством культури у 1986 році. Впродовж усієї історії діяльності у навчальному закладі активно впроваджуються новаторські методики освіти у сфері культури й мистецтва."
  },
  {
    "id": "3",
    "description": "Нині на музичному, театральному, хореографічному, образотворчому та підготовчому відділеннях навчається близько 1000 учнів віком від 2,5 до 17 років.Здобуття лауреатських звань учнями школи на різних рівнях (міському, всеукраїнському, міжнародному) стало «звичайною» справою, як і участь у концертах дитячої філармонії міста і програмах телебачення; не менш звичними стали й гастролі по Україні та за кордон (Франція, Німеччина, Туреччина, Індія, Ізраїль, Фінляндія, Греція, Словаччина, Польща, Італія та інші країни).Велика кількість учнів школи кожного навчального року нагороджуються стипендіями мера міста Києва та голови Шевченківської районної у м. Києві державної адміністрації.Близько 20% випускників щороку обирають мистецьку професію,вступаючи до середніх спеціальних і вищих навчальних закладів, і це досить високий кількісний показник для школи естетичного виховання, яка не ставить собі за мету професіоналізацію. Але і решта 80%, одержуючи свідоцтва про закінчення школи, не прощаються з нею: більшість ще протягом кількох років продовжує відвідувати улюблені заняття.Зрозуміло, що ціна успіху, передусім – майстерність викладачів, особлива творча атмосфера, на збереження якої спрямовуються спеціальні зусилля керівництва і всього колективу школи.Тридцять пʼять років навчальний заклад очолює директорка Ростовцева Лариса Онисимівна."
  },

  {
    "id": "4",
    "description": "За високі досягнення у галузі музичного виховання молоді, професіоналізм, відданість духовним традиціям національної культури, внесок щодо створення міжнародних звʼязків серед творчої молоді та активну концертну діяльність за 90 років існування школа отримала численні грамоти і подяки видатних діячів України, установ, організацій: Міністерства культури України, творчих спілок композиторів, художників та театральних діячів України, музеїв, громадських організацій, Посольств іноземних держав, оргкомітетів Міжнародних та Всеукраїнських конкурсів і фестивалів, депутатів Верховної ради та Президентів України."
  },
  {
    "id": "5",
    "description5": "З 2021 року КДШМ № 2 розміщується за адресою: вул. Бульварно-Кудрявська, 2, у будівлі, що є історичною та архітектурною пам’яткою. Цей об’єкт навчальний заклад відновнював із 2005 року, будучи замовником робіт «Реставрація з пристосуванням під розміщення.Державного спеціалізованого мистецького навчального закладу «Київська дитяча школа мистецтв Nº 2 ім. М. І. Вериківського», обʼєкта по вул. Воровського, 2 з прибудовою до нього концертної зали» складності СС3. Сертифікат Державної архітектурно-будівельної інспекції України, який засвідчує відповідність закінченого будівництвом обʼєкта школа отримала 27.04.2021р.Ця реставрація покращила матеріально-технічну базу навчального закладу і дала змогу збільшити його контингент до 1000 учнів.У школі створені сучасні умови для розвитку та збереження національної культури, її інтеграції до світового культурного простору, розвитку професійної мистецької освіти дітей та молоді.Нині КДШМ № 2 має можливість проводити Міжнародні та Всеукраїнські конкурси з усіх видів мистецтв."
  },
  {
    "id": "6",
    "description": "Викладачі школи працюють на рівні світових стандартів, учні представляють Україну за кордоном, перемагають у міжнародних конкурсах. Для навчання своїх дітей школу обрали представники посольств Латвії, Швеції, Франції, Норвегії, Польщі, Словаччини, Німеччини.В школі навчаються діти іноземних представництв Індії, Німеччині, Ірану, Словаччини, Вірменії, Узбекистану та міста Києва. Іноземні представництва запрошують колективи на свої заходи і свята."
  },
  {
    "id": "7",
    "description": "Запрошуємо і ваших дітей долучитися до родини КДШМ № 2 ім. М. І. Вериківського!"
  }
]
