[
  {
    "id": "1",
    "media": "museum/img1.webp",
    "description": "Михайло Вериківський – композитор європейського рівня. На початку XX ст. в Україні розпочався активний процес пробудження національної свідомості й становлення культурного пласта.В цей час з’являється ряд історичних постатей, на долю яких випала місія сформувати та піднести українську культуру до норм загальноєвропейського рівня. Серед таких особистостей гідне місце посідає і Михайло Іванович Вериківський, чия діяльність була спрямована на розвиток різних сфер музичного мистецтва.Відомий український композитор і громадський діяч П. О. Козицький назвав М. Вериківського першопрохідцем української музики. Імена цих двох видатних композиторів тісно пов’язані в історії української музичної культури 20-30-х років XX століття і, зокрема, його особливого етапу – національного відродження, що є притаманним європейській культурі. М. І. Вериківський засвоював новітні авангардні тенденції в організації культурно-творчого процесу, у прокладенні шляхів розвитку нових жанрів і передусім – у практичній розробці нових естетичних позицій музичного мистецтва на основі національної ідеї. "
  },
  {
    "id": "2",
    "media": "museum/img2.webp",
    "description": "М. Вериківський опановує нові жанрові моделі у камерній музиці, активно розвиває монологічний тип лірико-психологічної опери, розробляє принципово новий підхід до фольклорної традиції у хорових творах і обробках народних пісень.Михайло Іванович Вериківський завжди мріяв про те, щоб усі українські діти навчалися музики. І тому невипадково ще 2000 року постановою кабінету міністрів його ім’я було присвоєно Київській дитячій школі мистецтв № 2 і відкрито шкільний музей Михайла Вериківського. Це велика шкільна аудиторія, де є портрет композитора і багато фотографій, афіш, статей, нот, програм конференцій, підбірок матеріалів і самих матеріалів про Вериківського. Тут завжди звучить музика, проходять концерти, творчі зустрічі та інші заходи. М. І. Вериківський розпочав мистецький шлях у буремні роки громадянської війни. Йому належить заслуга створення перших в українській традиції зразків творів різних жанрів: реквіємів пам’яті М. Леонтовича та М. Лисенка, симфонічної сюїти «Веснянки»; він також автор першого українського балету «Бондарівна» (відомого ще під назвою «Пан Каньовський»).Композитор часто звертався до поезії Тараса Шевченка і написав за його творами опери «Наймичка» і «Сотник», хорову фантазію «Гайдамаки», вокальну поему для баса з оркестром «Чернець», хори, серед яких – знаменитий «Світе ясний».В кінці 20-х років музикант працював диригентом у Київській опері, а у повоєнні – очолював кафедру диригування столичної консерваторії.М. Вериківський вів багатогранну діяльність. З 1919 року працював у музично-творчих організаціях і був одним з перших, хто увійшов до складу музичного товариства Миколи Леонтовича"
  },
  {
    "id": "3",
    "media": "museum/img1.webp",
    "description": " У 1932 році майже всіх членів товариства звинуватили у буржуазному націоналізмі. Михайла Вериківського звинуватили у надмірній творчій увазі до історичної тематики, до української народної пісні, національного колориту. Моральний дискомфорт, пов’язаний із неможливістю повної реалізації творчих задумів і широкого виконання власних творів, Михайло Вериківський відчував до кінця свого життя. Але, не дивлячись на різні утиски, М. І. Вериківський був новатором у системі пошуку новітнього музичного мислення.Ключовими тенденціями усієї європейської культури першої половини XX століття був пошук нових елементів сучасної музичної мови.Величезний вплив на становлення художньо-естетичної, творчої, виконавської, композиторської культури мали праці Б. Яворського – видатного теоретика і вченого світового масштабу, учнем якого був М. Вериківський. Опанування теорії ладового ритму Б. Яворського – досить важливий етап творчого становлення М. Вериківського. Композитор намагався не лише втілити, а й переосмислити в руслі національних традицій особливості нової технології організації музичної мови.Михайло Вериківський мріяв про те, щоб народ мав власну культуру."
  },
  {
    "id": "4",
    "media": "museum/img2.webp",
    "description": "Процеси перебудови у сучасній школі, утвердження нової гуманістичної парадигми освіти ведуть до посилення культурологічної спрямованості, переорієнтації на формування духовної особистості, її творчий розвиток. Реалізація культуротворчої функції освіти передбачає цілеспрямоване використання надбань національного мистецтва у навчанні й вихованні молодого покоління.Таким надбанням національного усвідомлення є творчість М. І. Вериківського.Свої творчі здобутки М. І. Вериківський виносив на широку аудиторію (оперний театр, філармонія та інші), що відповідає європейській тенденції. Слід поціновувати національну культуру, вбачати у ній могутнє джерело виховання і навчання молодого покоління.«Скрізь, де іде рух за українську музику, ми чуємо ім’я М. Вериківського» – саме ці слова Миколи Грінченка можуть бути епіграфом до творчості видатного українського композитора, диригента, педагога і музично-громадського діяча, а отже композитора європейського рівня М. І. Вериківського."
  }
]
