export const declineWord = string => {
  if (string === 'Адреса') {
    return 'Адресу';
  }
  if (string === 'Карта') {
    return 'Карту';
  }
  if (string === 'Електронна пошта') {
    return 'Електронну Пошту';
  }
  if (string === 'Інформація для вступу') {
    return 'Інформацію для вступу';
  }
  if (string === 'Юридична інформація') {
    return 'Юридичну інформацію';
  }
  if (string === 'Музичне відділення') {
    return 'музичного відділення';
  }
  if (string === 'Вокально-хорове відділення') {
    return 'вокально-хорового відділення';
  }
  if (string === 'Хореографічне відділення') {
    return 'хореографічного відділення';
  }
  if (string === 'Театральне відділення') {
    return 'театрального відділення';
  }
  if (string === 'Образотворче відділення') {
    return 'образотворчого відділення';
  }
  if (string === 'Дошкільне та підготовче відділення') {
    return 'дошкільного та підготовчого відділення';
  }
  return string;
};
